IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DMASS0_BCDMA_0_BCDMA_TCHANRT.xml
<module name="DMASS0_BCDMA_0_BCDMA_TCHANRT" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="BCDMA_TCHANRT_TRT_CTL" acronym="BCDMA_TCHANRT_TRT_CTL" offset="0x0" width="32" description="The Tx Channel Realtime Control Register contains real-time control and status information for the Tx DMA channel.  The fields in this register can safely be changed while the channel is in operation.">
		<bitfield id="TX_ENABLE" width="1" begin="31" end="31" resetval="0x0" description="This field enables or disables the channel.  Disabling a channel halts operation on the channel after the current block transfer is completed.  Disabling a channel in the middle of a packet transfer may result in underflow conditions in the attached application block and data loss.  When a channel is disabled, the implementation may choose to reset all state for the channel.   The pause bit should be asserted instead of clearing enable directly if the intent is to temporarily pause the channel. This field is encoded as follows: 0 = channel is disabled 1 = channel is enabled  This field will be cleared by HW after a teardown is requested to indicate that the channel teardown is complete." range="31" rwaccess="R/W"/> 
		<bitfield id="TX_TEARDOWN" width="1" begin="30" end="30" resetval="0x0" description="Channel teardown: Setting this bit will request the channel to be torn down.  This field will remain set after a channel teardown is complete." range="30" rwaccess="R/W"/> 
		<bitfield id="TX_PAUSE" width="1" begin="29" end="29" resetval="0x0" description="Channel pause: Setting this bit will cause the channel to pause processing immediately." range="29" rwaccess="R/W"/> 
		<bitfield id="TX_FORCED_TEARDOWN" width="1" begin="28" end="28" resetval="0x0" description="Channel forced teardown: Setting this bit will cause the channel to stop waiting on trigger events.  When this bit is set, the implementation may choose to bypass data transfers and event generation.  This bit is a modifier to the normal tx_teardown and is intended to flush the channel to recover any descriptor or TR references which are currently being held by the BCDMA even if the trigger source is no longer functioning.  Uso fo this bit is considered a 'catastrophic' condition and it is assumed that SW will need to perform some re-initialization in the system to re-align events, data buffers, etc.  This bit should be set in addition to the tx_teardown bit in order to cause a forced teardown.  This field will remain set after a channel teardown is complete." range="28" rwaccess="R/W"/> 
		<bitfield id="TX_ERROR" width="1" begin="0" end="0" resetval="0x0" description="Channel error:  This bit will be set anytime an error has occurred on the channel.  This bit is cleared by writing back a 0." range="0" rwaccess="R"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_SWTRIG" acronym="BCDMA_TCHANRT_TRT_SWTRIG" offset="0x8" width="32" description="The Software Trigger Register provides a mechanism by which software can directly trigger the channel in a secure way.  This register is only used when the tx_chan_type is configured as a Third Party DMA channel. This register has no function when the channel is configured for packet mode transfers. A write to this register will cause an event to be sent to this channel.">
		<bitfield id="TRIGGER" width="1" begin="0" end="0" resetval="0x0" description="Trigger: writing this bit with a value of 1 will cause the trigger event to be sent to this channel" range="0" rwaccess="NA/W"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_STATUS0" acronym="BCDMA_TCHANRT_TRT_STATUS0" offset="0x40" width="32" description="The Status Register provides a read only view of channel status bits.">
		<bitfield id="TRING_PEND" width="1" begin="31" end="31" resetval="0x0" description="The channel ring has a descriptor" range="31" rwaccess="R"/> 
		<bitfield id="TXQ_PEND" width="1" begin="30" end="30" resetval="0x0" description="The channel fifo is available" range="30" rwaccess="R"/> 
		<bitfield id="PKTID_AVAIL" width="1" begin="29" end="29" resetval="0x0" description="The channel has an available packet id" range="29" rwaccess="R"/> 
		<bitfield id="PKTID_BUSY" width="1" begin="28" end="28" resetval="0x0" description="There is an outstanding pktid for the channel" range="28" rwaccess="R"/> 
		<bitfield id="BUSY" width="1" begin="25" end="25" resetval="0x0" description="The channel is busy" range="25" rwaccess="R"/> 
		<bitfield id="TRANSBUSY" width="1" begin="24" end="24" resetval="0x0" description="The channel has an outstanding transaction" range="24" rwaccess="R"/> 
		<bitfield id="IN_PACKET" width="1" begin="23" end="23" resetval="0x0" description="The channel is currently in a packet" range="23" rwaccess="R"/> 
		<bitfield id="OK" width="1" begin="22" end="22" resetval="0x0" description="The channel is ready to be scheduled" range="22" rwaccess="R"/> 
		<bitfield id="WAVAIL" width="1" begin="21" end="21" resetval="0x0" description="The fifo for the channel has space to place a burst size entry" range="21" rwaccess="R"/> 
		<bitfield id="TDOWN_MSG_PEND" width="1" begin="18" end="18" resetval="0x0" description="A teardown message is pending" range="18" rwaccess="R"/> 
		<bitfield id="TX_REQS" width="1" begin="17" end="17" resetval="0x0" description="The channel is sending a schedule request" range="17" rwaccess="R"/> 
		<bitfield id="ERR_EVENT_REQS" width="1" begin="16" end="16" resetval="0x0" description="The channel is trying to schedule an error event" range="16" rwaccess="R"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_STATUS1" acronym="BCDMA_TCHANRT_TRT_STATUS1" offset="0x44" width="32" description="The Status Register provides a read only view of channel status bits.">
		<bitfield id="TX_REQS" width="1" begin="31" end="31" resetval="0x0" description="The channel is sending a schedule request" range="31" rwaccess="R"/> 
		<bitfield id="WAVAIL" width="1" begin="24" end="24" resetval="0x0" description="The fifo has space for a burst size" range="24" rwaccess="R"/> 
		<bitfield id="TDNULL" width="1" begin="8" end="8" resetval="0x0" description="The channel has met the conditions to do teardown" range="8" rwaccess="R"/> 
		<bitfield id="CHANNEL_OK" width="1" begin="7" end="7" resetval="0x0" description="Channel is trying to schedule work" range="7" rwaccess="R"/> 
		<bitfield id="CHANNEL_BUSY" width="1" begin="6" end="6" resetval="0x0" description="Channel has outstanding work to do" range="6" rwaccess="R"/> 
		<bitfield id="IN_PACKET_ARRAY" width="1" begin="3" end="3" resetval="0x0" description="The channel is in a packet" range="3" rwaccess="R"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_STDATA" acronym="BCDMA_TCHANRT_TRT_STDATA" offset="0x80" width="32" description="The State Data Registers contain the current working state of the Tx DMA channel. These registers are provided so that the Host can determine the potential cause of an error or exception condition which was reported by the channel.  These registers should not be accessed without reason while the BCDMA is operating as accesses will cause performance to decrease as these MMRs are just providing a window into the actual state RAM">
		<bitfield id="STATE_INFO" width="32" begin="31" end="0" resetval="0x0" description="See Tx state mapping table" range="31 - 0" rwaccess="R/NA"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_PEER0" acronym="BCDMA_TCHANRT_TRT_PEER0" offset="0x200" width="32" description="This register provides access to the remote peer's realtime register at 0x400.">
		<bitfield id="PEER_DATA" width="32" begin="31" end="0" resetval="0x0" description="Peer realtime register data (varies by paired peer)." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_PEER1" acronym="BCDMA_TCHANRT_TRT_PEER1" offset="0x204" width="32" description="This register provides access to the remote peer's realtime register at 0x401.">
		<bitfield id="PEER_DATA" width="32" begin="31" end="0" resetval="0x0" description="Peer realtime register data (varies by paired peer)." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_PEER2" acronym="BCDMA_TCHANRT_TRT_PEER2" offset="0x208" width="32" description="This register provides access to the remote peer's realtime register at 0x402.">
		<bitfield id="PEER_DATA" width="32" begin="31" end="0" resetval="0x0" description="Peer realtime register data (varies by paired peer)." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_PEER3" acronym="BCDMA_TCHANRT_TRT_PEER3" offset="0x20C" width="32" description="This register provides access to the remote peer's realtime register at 0x403.">
		<bitfield id="PEER_DATA" width="32" begin="31" end="0" resetval="0x0" description="Peer realtime register data (varies by paired peer)." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_PEER4" acronym="BCDMA_TCHANRT_TRT_PEER4" offset="0x210" width="32" description="This register provides access to the remote peer's realtime register at 0x404.">
		<bitfield id="PEER_DATA" width="32" begin="31" end="0" resetval="0x0" description="Peer realtime register data (varies by paired peer)." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_PEER5" acronym="BCDMA_TCHANRT_TRT_PEER5" offset="0x214" width="32" description="This register provides access to the remote peer's realtime register at 0x405.">
		<bitfield id="PEER_DATA" width="32" begin="31" end="0" resetval="0x0" description="Peer realtime register data (varies by paired peer)." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_PEER6" acronym="BCDMA_TCHANRT_TRT_PEER6" offset="0x218" width="32" description="This register provides access to the remote peer's realtime register at 0x406.">
		<bitfield id="PEER_DATA" width="32" begin="31" end="0" resetval="0x0" description="Peer realtime register data (varies by paired peer)." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_PEER7" acronym="BCDMA_TCHANRT_TRT_PEER7" offset="0x21C" width="32" description="This register provides access to the remote peer's realtime register at 0x407.">
		<bitfield id="PEER_DATA" width="32" begin="31" end="0" resetval="0x0" description="Peer realtime register data (varies by paired peer)." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_PEER8" acronym="BCDMA_TCHANRT_TRT_PEER8" offset="0x220" width="32" description="This register provides access to the remote peer's realtime register at 0x408.">
		<bitfield id="PEER_DATA" width="32" begin="31" end="0" resetval="0x0" description="Peer realtime register data (varies by paired peer)." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_PEER9" acronym="BCDMA_TCHANRT_TRT_PEER9" offset="0x224" width="32" description="This register provides access to the remote peer's realtime register at 0x409.">
		<bitfield id="PEER_DATA" width="32" begin="31" end="0" resetval="0x0" description="Peer realtime register data (varies by paired peer)." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_PEER10" acronym="BCDMA_TCHANRT_TRT_PEER10" offset="0x228" width="32" description="This register provides access to the remote peer's realtime register at 0x40A.">
		<bitfield id="PEER_DATA" width="32" begin="31" end="0" resetval="0x0" description="Peer realtime register data (varies by paired peer)." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_PEER11" acronym="BCDMA_TCHANRT_TRT_PEER11" offset="0x22C" width="32" description="This register provides access to the remote peer's realtime register at 0x40B.">
		<bitfield id="PEER_DATA" width="32" begin="31" end="0" resetval="0x0" description="Peer realtime register data (varies by paired peer)." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_PEER12" acronym="BCDMA_TCHANRT_TRT_PEER12" offset="0x230" width="32" description="This register provides access to the remote peer's realtime register at 0x40C.">
		<bitfield id="PEER_DATA" width="32" begin="31" end="0" resetval="0x0" description="Peer realtime register data (varies by paired peer)." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_PEER13" acronym="BCDMA_TCHANRT_TRT_PEER13" offset="0x234" width="32" description="This register provides access to the remote peer's realtime register at 0x40D.">
		<bitfield id="PEER_DATA" width="32" begin="31" end="0" resetval="0x0" description="Peer realtime register data (varies by paired peer)." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_PEER14" acronym="BCDMA_TCHANRT_TRT_PEER14" offset="0x238" width="32" description="This register provides access to the remote peer's realtime register at 0x40E.">
		<bitfield id="PEER_DATA" width="32" begin="31" end="0" resetval="0x0" description="Peer realtime register data (varies by paired peer)." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_PEER15" acronym="BCDMA_TCHANRT_TRT_PEER15" offset="0x23C" width="32" description="This register provides access to the remote peer's realtime register at 0x40F.">
		<bitfield id="PEER_DATA" width="32" begin="31" end="0" resetval="0x0" description="Peer realtime register data (varies by paired peer)." range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_PCNT" acronym="BCDMA_TCHANRT_TRT_PCNT" offset="0x400" width="32" description="The statistics registers are supplied to give software applications operational progress status for the channel.">
		<bitfield id="PCNT" width="32" begin="31" end="0" resetval="0x0" description="Current completed packet count for the channel." range="31 - 0" rwaccess="R/WTD"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_BCNT" acronym="BCDMA_TCHANRT_TRT_BCNT" offset="0x408" width="32" description="The statistics registers are supplied to give software applications operational progress status for the channel.">
		<bitfield id="BCNT" width="32" begin="31" end="0" resetval="0x0" description="Current completed payload byte count for the channel." range="31 - 0" rwaccess="R/WTD"/>
	</register>
	<register id="BCDMA_TCHANRT_TRT_SBCNT" acronym="BCDMA_TCHANRT_TRT_SBCNT" offset="0x410" width="32" description="The statistics registers are supplied to give software applications operational progress status for the channel.">
		<bitfield id="SBCNT" width="32" begin="31" end="0" resetval="0x0" description="Current started byte count for the channel." range="31 - 0" rwaccess="R/WTD"/>
	</register>
</module>